return {
  "nvim-treesitter/nvim-treesitter-context",
  -- Опционально: если вы хотите настроить плагин
  opts = {
    enable = true, -- включить плагин
    max_lines = 0, -- 0 означает, что высота контекстного окна не ограничена
    min_window_height = 0, -- минимальная высота окна редактора для включения контекста
    line_numbers = true,
    multiline_threshold = 20, -- показывать контекст только для блоков кода длиннее 20 строк
    trim_scope = "outer", -- показывать только внешний контекст
    mode = "cursor", -- показывать контекст для строки, где находится курсор
  },
}
